<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

# Lab 3.1.3: 
# *Database Programming with Python and SQLite*

<a name="demo"></a>
## Using SQLite

### Advantages of SQLite

- does not run on a separate server
- creates portable SQL databases saved in a single file
- databases are stored in a very efficient manner and allow fast querying
- ideal for small databases or databases that need to be copied across machines.
- prototyping applications (e.g. as an embedded database server in a Python program).

### The `sqlite3` Command Line Utility

- useful for basic SQL tasks and databse maintenance
- for creating and dropping databases, it may be safer to use the command line than to roll the code into a Python program

1. Add the sqlite3 installation folder to your PATH environment variable.
2. Open a command window.
3. Navigate to your preferred working directory.
4. Start the sqlite3 command line utility and create a database called "ex1":

`$ sqlite3 ex1`

Output:  

`SQLite version 3.8.5 2014-05-29 12:36:14
Enter ".help" for usage hints.
sqlite>`

*Nb. If you leave out the database name (after `sqlite3`, above) a new, temporary database will be created; it will be destroyed upon exiting sqlite3.*

Enter the following commands at the sqlite prompt (not shown):

`create table tbl1(one varchar(10), two smallint);
insert into tbl1 values('hello!',10);
insert into tbl1 values('goodbye', 20);
select * from tbl1;`

Output:  

`hello!|10
goodbye|20`

Enter `.help` at the sqlite3 command prompt. This lists the available "dot commands". 

Some of the more useful dot commands include:

`  
.backup ?DB? FILE      Backup DB (default "main") to FILE.
.cd DIRECTORY          Change the working directory to DIRECTORY
.clone NEWDB           Clone data into NEWDB from the existing database
.databases             List names and files of attached databases
.dump ?TABLE? ...      Dump the database in an SQL text format.
.excel                 Display the output of next command in a spreadsheet
.exit                  Exit this program
.headers on|off        Turn display of headers on or off
.help                  Show this message
.import FILE TABLE     Import data from FILE into TABLE
.indexes ?TABLE?       Show names of all indexes.
.quit                  Exit this program
.read FILENAME         Execute SQL in FILENAME
.restore ?DB? FILE     Restore content of DB (default "main") from FILE
.save FILE             Write in-memory database into FILE
.tables ?TABLE?        List names of tables.`

### The `sqlite3` package

The easiest way to incorporate an SQL database into a Python application is by using the `sqlite3` package for [`Python 2.7`](https://docs.python.org/2.7/library/sqlite3.html) or [`Python 3.x`](https://docs.python.org/3/library/sqlite3.html).

Open a connection to an SQLite database file.  As before, if the file does not already exist it will automatically be created.

In [4]:
import sqlite3
sqlite_db = 'test_db.sqlite'
conn = sqlite3.connect(sqlite_db) 
c = conn.cursor()

Commands can be executed by passing them as string arguments to the `execute` method of the cursor we just created for this database.

*Nb. If this script has never been run before, the following will raise an (inconsequential) error message:*

In [29]:
c.execute('DROP TABLE houses;')

# Save (commit) the changes:
conn.commit()

In [30]:
c.execute('CREATE TABLE houses (field1 INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')
conn.commit()

With the database saved the table should now be viewable using SQLite Manager.

#### Adding data

Since we're back in python, we can now use regular programming techniques in conjunction with the sqlite connection.  In particular, the cursor's `execute()` method supports value substitution using the `?` character, which makes adding multiple records a bit easier.  See the [docs](https://docs.python.org/2.7/library/sqlite3.html) for more details.

> c.execute(sql_command, values)

In [32]:
# A
last_sale = (None, 4000, 5, 22, 619000)

# Execute Command
c.execute('INSERT INTO houses VALUES(?,?,?,?,?)',last_sale)
# Remember to commit the changes
conn.commit()

Notice that in this syntax we use the python `None` value, rather than `NULL`, to trigger SQLite to auto-increment the Primary Key. 

There is a related cursor method `executemany()` which takes an array of tuples and loops through them, substituting one tuple at a time.

> c.executemany(sql_command, values)

In [34]:
# A
recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]

# Nb. The "?" parameters are placeholders for data that will map to the table columns during insertion;
# this is a security measure against SQL injection attacks:
# 
c.executemany('INSERT INTO houses VALUES(?,?,?,?,?)',recent_sales)
conn.commit()

Select all rows from houses

In [35]:
# A
results = c.execute("SELECT * FROM houses")
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 2390, 4, 34, 319000),
 (3, 1870, 3, 14, 289000),
 (4, 1505, 3, 90, 269000)]




#### Adding data from a csv file
One way to populate the database from a file is to use `numpy.genfromtxt` to read the file into an array (converted to a list for easier handling), and then `INSERT` those records into the database.  The `genfromtxt` function has options including the output data type, handling of missing values, skipping of header and footer rows, columns to read, and more.

import pandas as pd
data_csv = r'D:\IOD\Data\Datasets 2\housing-data.csv'
data = pd.read_csv(data_csv)
data.head(5)

In [61]:
from numpy import genfromtxt

# import into nparray of ints, then convert to list of lists:
data = genfromtxt(r'D:\IOD\Data\Datasets 2\housing-data.csv', dtype = 'i8', 
                    delimiter = ',', skip_header = 1).tolist()
data

[[2104, 3, 70, 399900],
 [1600, 3, 28, 329900],
 [2400, 3, 44, 369000],
 [1416, 2, 49, 232000],
 [3000, 4, 75, 539900],
 [1985, 4, 61, 299900],
 [1534, 3, 12, 314900],
 [1427, 3, 57, 198999],
 [1380, 3, 14, 212000],
 [1494, 3, 15, 242500],
 [1940, 4, 7, 239999],
 [2000, 3, 27, 347000],
 [1890, 3, 45, 329999],
 [4478, 5, 49, 699900],
 [1268, 3, 58, 259900],
 [2300, 4, 77, 449900],
 [1320, 2, 62, 299900],
 [1236, 3, 78, 199900],
 [2609, 4, 5, 499998],
 [3031, 4, 21, 599000],
 [1767, 3, 44, 252900],
 [1888, 2, 79, 255000],
 [1604, 3, 13, 242900],
 [1962, 4, 53, 259900],
 [3890, 3, 36, 573900],
 [1100, 3, 60, 249900],
 [1458, 3, 29, 464500],
 [2526, 3, 13, 469000],
 [2200, 3, 28, 475000],
 [2637, 3, 25, 299900],
 [1839, 2, 40, 349900],
 [1000, 1, 5, 169900],
 [2040, 4, 75, 314900],
 [3137, 3, 67, 579900],
 [1811, 4, 24, 285900],
 [1437, 3, 50, 249900],
 [1239, 3, 22, 229900],
 [2132, 4, 28, 345000],
 [4215, 4, 66, 549000],
 [2162, 4, 43, 287000],
 [1664, 2, 40, 368500],
 [2238, 3, 37, 329900],
 [2567, 4, 57, 314000],
 [1200, 3, 76, 299000],
 [852, 2, 70, 179900],
 [1852, 4, 64, 299900],
 [1203, 3, 11, 239500]]

Suppose we need to put a placeholder in the first column for data that will be available later. Best practice is to insert the value `None`:

In [62]:
# prepend a None value to beginning of each sub-list:
for d in data:
    d.insert(0, None)

*Nb. This is why we converted the input array to a list. An array can only hold one type of data (integers in this case) so we could not have inserted `None` before we did this conversion.*

In [63]:
# check:
print(type(data))
print(data[0:3])

<class 'list'>
[[None, 2104, 3, 70, 399900], [None, 1600, 3, 28, 329900], [None, 2400, 3, 44, 369000]]

Now we can insert each list item as a row of fields in the database.

In [67]:
# loop through data, running an INSERT on each record (i.e. sublist):
for d in data:
    c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d)

conn.commit()

In this case, because we were inserting the same value for all records, so we could have simply used a 'None' in the numpy `insert` method at column 0.

In [69]:
import numpy as np
d1 = np.asarray([1200, 3, 15, 250000])
d1 = d1.tolist()
d1.insert(0, None)
d1
c.execute('INSERT INTO houses VALUES (?, ?, ?, ?, ?)', d1)
conn.commit()

#### Deleting Rows

The `DELETE FROM` statement can be used with a `WHERE` clause to specify rows to delete based on some criteria.

In [72]:
c.execute('DELETE FROM houses WHERE field1 IN (52, 53)')
conn.commit()

QUIZ: What would `DELETE FROM houses` do?

#### Filtering Rows

**1. Select Rows Where Bedrooms = 4**

SELECT *
FROM houses
WHERE bdrms = 4

In [74]:
c.execute('SELECT *FROM houses WHERE bdrms = 4')
conn.commit()

houses

In [76]:
# ANSWER
results = c.execute('SELECT *FROM houses WHERE bdrms = 4')
results.fetchall()

[(2, 2390, 4, 34, 319000),
 (9, 3000, 4, 75, 539900),
 (10, 1985, 4, 61, 299900),
 (15, 1940, 4, 7, 239999),
 (20, 2300, 4, 77, 449900),
 (23, 2609, 4, 5, 499998),
 (24, 3031, 4, 21, 599000),
 (28, 1962, 4, 53, 259900),
 (37, 2040, 4, 75, 314900),
 (39, 1811, 4, 24, 285900),
 (42, 2132, 4, 28, 345000),
 (43, 4215, 4, 66, 549000),
 (44, 2162, 4, 43, 287000),
 (47, 2567, 4, 57, 314000),
 (50, 1852, 4, 64, 299900),
 (56, 3000, 4, 75, 539900),
 (57, 1985, 4, 61, 299900),
 (62, 1940, 4, 7, 239999),
 (67, 2300, 4, 77, 449900),
 (70, 2609, 4, 5, 499998),
 (71, 3031, 4, 21, 599000),
 (75, 1962, 4, 53, 259900),
 (84, 2040, 4, 75, 314900),
 (86, 1811, 4, 24, 285900),
 (89, 2132, 4, 28, 345000),
 (90, 4215, 4, 66, 549000),
 (91, 2162, 4, 43, 287000),
 (94, 2567, 4, 57, 314000),
 (97, 1852, 4, 64, 299900)]

**2. Run a query to calculate the average floor area and price of each size of house (i.e. by number of bedrooms):**

In [77]:
# ANSWER
results = c.execute("SELECT bdrms, AVG(sqft) AS avg_sqft, AVG(price) AS avg_price FROM houses GROUP BY bdrms")
results.fetchall()

[(1, 1000.0, 169900.0),
 (2, 1496.5, 280866.6666666667),
 (3, 1807.8653846153845, 320161.46153846156),
 (4, 2400.0689655172414, 375434.275862069),
 (5, 4318.666666666667, 672933.3333333334)]

### Pandas connector

While databases provide many analytical capabilities, at some point we may need to pull data into Python for more flexible processing. Large, fixed operations would be more efficient in a database, but Pandas allows for interactive processing.

For example, if you want to aggregate nightly log-ins or sales for a report or dashboard, this would be a fixed operation on a large dataset. These computations would run more efficiently in the database system itself.

However, if we wanted to model the patterns of login behaviour or factors driving sales, then we would import the data to Python where we could use its simple interfaces to powerful analytic libraries.

In [78]:
import pandas as pd
from pandas.io import sql

Pandas can connect to most relational databases. In this demonstration, we will create and connect to a SQLite database.

### Writing data into a database

Data in Pandas can be loaded into a relational database. 

If the data table is not too large, we can load all of it into a Pandas DataFrame:

In [79]:
# Nb. Use low_memory=False to ensure that type inference does not fail due to buffered processing of input:
data = pd.read_csv(r'D:\IOD\Data\Datasets 2\housing-data.csv', low_memory = False)
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

We can move data in the opposite direction -- from a DataFrame to a database -- using the `to_sql` command, similar to the `to_csv` command.

`to_sql` takes as arguments:
    - `name`, the table name to create
    - `con`, a connection to a database
    - `index`, whether to input the index column
    - `schema`, if we want to write a custom schema for the new table
    - `if_exists`, what to do if the table already exists. We can overwrite it, add to it, or fail

This copies our `data` DataFrame to a sqlite3 table called `houses_pandas`:

In [80]:
data.to_sql('houses_pandas', con = conn, if_exists = 'replace', index = False)

47

Run a query to get the average price of each house size from this table:

In [81]:
#ANSWER
results = c.execute("SELECT bdrms, AVG(price) AS avg_price FROM houses GROUP BY sqft")
results.fetchall()

[(2, 179900.0),
 (1, 169900.0),
 (3, 249900.0),
 (3, 274500.0),
 (3, 239500.0),
 (3, 199900.0),
 (3, 229900.0),
 (3, 259900.0),
 (2, 299900.0),
 (3, 212000.0),
 (2, 232000.0),
 (3, 198999.0),
 (3, 249900.0),
 (3, 464500.0),
 (3, 242500.0),
 (3, 269000.0),
 (3, 314900.0),
 (3, 329900.0),
 (3, 242900.0),
 (2, 368500.0),
 (3, 252900.0),
 (4, 285900.0),
 (2, 349900.0),
 (4, 299900.0),
 (3, 289000.0),
 (2, 255000.0),
 (3, 329999.0),
 (4, 239999.0),
 (4, 259900.0),
 (4, 299900.0),
 (3, 347000.0),
 (4, 314900.0),
 (3, 399900.0),
 (4, 345000.0),
 (4, 287000.0),
 (3, 475000.0),
 (3, 329900.0),
 (4, 449900.0),
 (4, 319000.0),
 (3, 369000.0),
 (3, 469000.0),
 (4, 314000.0),
 (4, 499998.0),
 (3, 299900.0),
 (4, 539900.0),
 (4, 599000.0),
 (3, 579900.0),
 (3, 573900.0),
 (5, 619000.0),
 (4, 549000.0),
 (5, 699900.0)]

## Discussion

**Scenarios for using Pandas with SQLite**

1. When would you want to use Pandas on a dataset before storing it in a database?

2. When would you want to use Pandas on a dataset retrieved from a database?

<a name="guided-practice"></a>


# Reference: SQL Syntax 


#### SELECT Statement
Every query should start with `SELECT`.  `SELECT` is followed by the names of the columns in the output.

`SELECT` is always paired with `FROM`, and `FROM` identifies the table to retrieve data from.

```sql
SELECT
<columns>
FROM
<table>
```

`SELECT *` denotes returns *all* of the columns.

Housing Data example:
```sql
SELECT
sqft, bdrms
FROM houses_pandas;
```

**Check:** Write a query that returns the `sqft`, `bdrms` and `price`.

```sql
SELECT
sqft, bdrms, price
FROM houses_pandas;
```

#### WHERE Clause
`WHERE` is used to filter table to a specific criteria and follows the `FROM` clause.

```sql
SELECT
<columns>
FROM
<table>
WHERE
<condition>
```
Example:
```sql
SELECT
sqft, bdrms, age, price
FROM houses_pandas
WHERE bdrms = 2 and price < 250000;
```

The condition is effectively a row filter; rows that match the condition will be included in the rowset that is returned by the query.

**Check:** Write a query that returns the `sqft`, `bdrms`, `age` for houses older than 60 years.
>```sql
SELECT
sqft, bdrms, age
FROM houses_pandas
WHERE age > 60;
```

### AGGREGATIONS

Aggregations (or aggregate functions) are functions where the values of multiple rows are grouped together as input on certain criteria to form a single value of more significant meaning or measurement such as a set, a bag or a list.

Examples of aggregate funtions:

- Average (i.e., arithmetic mean)
- Count
- Maximum
- Minimum
- Median
- Mode
- Sum

In SQL they are performed in a `SELECT` statement as follows.

```sql
SELECT COUNT(price)
FROM houses_pandas;
```

```sql
SELECT AVG(sqft), MIN(price), MAX(price)
FROM houses_pandas
WHERE bdrms = 2;
```

### Read Order Data
- P12-ListOfOrders
- P12-OrderBreakdown

#### 1. Read CSV into DataFrame

In [82]:
import pandas as pd
import sqlite3
from pandas.io import sql

In [84]:
# Reading CSV to Dataframe
orders = pd.read_csv(r'D:\IOD\Data\Datasets 2\P12-ListOfOrders.csv', encoding = 'utf-8')
orders_break_down =  pd.read_csv(r'D:\IOD\Data\Datasets 2\P12-OrderBreakdown.csv', encoding = 'utf-8')

In [85]:
orders.head()

          Order ID  Order Date      Customer Name         Country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France

In [86]:
orders_break_down.head()

,Order ID,Product Name,Discount,Sales,Quantity,Category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140,3,Office Supplies
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27,2,Office Supplies
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17,2,Office Supplies

#### 2. Replace Space with Underscore in Column Names

In [88]:
# ANSWER
orders.columns = [o.replace(' ', '_') for o in orders.columns.str.lower()]
orders.head(3)

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France

In [89]:
# ANSWER
orders_break_down.columns = [o.replace(' ', '_') for o in orders_break_down.columns.str.lower()]
orders_break_down.head(3)

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140,3,Office Supplies

#### 3. Check DataTypes

In [90]:
# ANSWER
orders.dtypes

order_id         object
order_date       object
customer_name    object
country          object
dtype: object

In [91]:
# ANSWER
orders_break_down.dtypes

order_id         object
product_name     object
discount        float64
sales             int64
quantity          int64
category         object
dtype: object

#### 4. Save these two dataframes as a table in sqlite

In [96]:
# Establishing Local DB connection
db_connection = sqlite3.connect(r'D:\IOD\Data\eshop.db.sqlite')

# Save these two dataframes as a table in sqlite
orders.to_sql('orders', con = db_connection, if_exists = 'replace', index = False)
orders_break_down.to_sql('orders_break_down', con = db_connection, if_exists = 'replace', index = False)

8047

#### 5. Select Number of Orders for Each Customer

We can use the `sql` function in `pandas.io` to run SQL queries to the database with the `.read_sql()` method. Here's an example:

In [97]:
# Select first 10 rows of all columns in orders table

query = """
        SELECT * 
        FROM orders 
        LIMIT 10;
        """

orders_head_10 = sql.read_sql(query, con=db_connection)
orders_head_10

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom
2  ES-2011-4939443  2011-01-04     Arthur Prichep          France
3  IT-2011-2942451  2011-01-04     Grant Thornton  United Kingdom
4  ES-2011-3848439  2011-01-05   Michael Granlund          France
5  ES-2011-5433855  2011-01-07       Dave Poirier          France
6  IT-2011-4546695  2011-01-08      Darren Powers          France
7  ES-2011-1138719  2011-01-11       Eric Murdock           Italy
8  ES-2011-1466305  2011-01-11         Mick Brown         Austria
9  ES-2011-4359424  2011-01-11  Dorothy Dickinson           Spain

In [101]:
# Select Number of Orders for Each Customer
query = """
        SELECT COUNT(order_id), customer_name
        FROM orders 
        GROUP BY customer_name;
        """

result = sql.read_sql(query, con=db_connection)
result

     COUNT(order_id)       customer_name
0                 11       Aaron Bergman
1                  7       Aaron Hawkins
2                 12      Aaron Smayling
3                  4     Adam Bellavance
4                  8           Adam Hart
..               ...                 ...
787                2        Xylona Preis
788                5       Yana Sorensen
789               11      Yoseph Carroll
790                9    Zuschuss Carroll
791                6  Zuschuss Donatelli

[792 rows x 2 columns]

#### 6. Select Number of Customers for Each Country

In [102]:
# Select Number of Customers for Each Country
query = """
        SELECT COUNT(customer_name),country 
        FROM orders 
        GROUP BY country;
        """

result = sql.read_sql(query, con=db_connection)
result

    COUNT(customer_name)         country
0                    135         Austria
1                     68         Belgium
2                     29         Denmark
3                     34         Finland
4                    991          France
5                    806         Germany
6                     50         Ireland
7                    493           Italy
8                    194     Netherlands
9                     37          Norway
10                    37        Portugal
11                   403           Spain
12                   100          Sweden
13                    40     Switzerland
14                   700  United Kingdom

#### 7.A Select discount, sales, quantity for Each Order from orders_break_down Table

In [103]:
#  Select discount, sales, quantity for Each Order from orders_break_down Table
query = """
        SELECT discount, sales, quantity
        FROM orders_break_down;
        """

result = sql.read_sql(query, con=db_connection)
result

      discount  sales  quantity
0          0.5     45         3
1          0.0    854         7
2          0.0    140         3
3          0.5     27         2
4          0.5     17         2
...        ...    ...       ...
8042       0.0    245         2
8043       0.5     30         2
8044       0.5     23         4
8045       0.5    108         3
8046       0.0    867         5

[8047 rows x 3 columns]

#### 7.B Select discount, sales, quantity, total price for Each Order from orders_break_down Table

> Total Price = sales * quantity - discount

In [107]:
# Select discount, sales, quantity, total price for Each Order from orders_break_down Table
query = """
        SELECT *, (sales * quantity - discount) AS total_price
        FROM orders_break_down;
        """

result = sql.read_sql(query, con=db_connection)
result

,order_id,product_name,discount,sales,quantity,category,total_price
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies,134.5
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture,5978.0
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140,3,Office Supplies,420.0
3,IT-2011-2942451,"Boston Markers, Easy-Erase",0.5,27,2,Office Supplies,53.5
4,IT-2011-2942451,"Eldon Folders, Single Width",0.5,17,2,Office Supplies,33.5
...,...,...,...,...,...,...,...
8042,ES-2014-3458802,"Ikea Stackable Bookrack, Traditional",0.0,245,2,Furniture,490.0
8043,IT-2014-3715679,"BIC Pencil Sharpener, Fluorescent",0.5,30,2,Office Supplies,59.5
8044,IT-2014-3715679,"Avery Binder Covers, Recycled",0.5,23,4,Office Supplies,91.5
8045,IT-2014-3715679,"StarTech Phone, Red",0.5,108,3,Technology,323.5
8046,ES-2014-3458802,"Motorola Audio Dock, VoIP",0.0,867,5,Technology,4335.0

#### 7.C Select All Orders from orders_break_down Table Where Total Price Greater Than 100

In [109]:
# Select All Orders from orders_break_down Table Where Total Price Greater Than 100
query = """
        SELECT *, (sales * quantity - discount) AS total_price
        FROM orders_break_down
        WHERE total_price > 100;
        """

result = sql.read_sql(query, con=db_connection)
result

,order_id,product_name,discount,sales,quantity,category,total_price
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies,134.5
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture,5978.0
2,ES-2011-4939443,"Binney & Smith Sketch Pad, Easy-Erase",0.0,140,3,Office Supplies,420.0
3,ES-2011-3848439,"Binney & Smith Pencil Sharpener, Water Color",0.0,90,3,Office Supplies,270.0
4,ES-2011-3848439,"Sanford Canvas, Fluorescent",0.0,207,4,Office Supplies,828.0
...,...,...,...,...,...,...,...
6461,ES-2014-2815584,"Kleencut Shears, Serrated",0.0,261,6,Office Supplies,1566.0
6462,ES-2014-4785777,"Wilson Jones Index Tab, Economy",0.0,32,5,Office Supplies,160.0
6463,ES-2014-3458802,"Ikea Stackable Bookrack, Traditional",0.0,245,2,Furniture,490.0
6464,IT-2014-3715679,"StarTech Phone, Red",0.5,108,3,Technology,323.5
6465,ES-2014-3458802,"Motorola Audio Dock, VoIP",0.0,867,5,Technology,4335.0

#### 8. Select All Customer And The Product They Have Bought

In [110]:
orders_break_down.head(2)

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture

In [111]:
orders.head(2)

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom

In [113]:
# Select All Customer And The Product They Have Bought
query = """
        SELECT customer_name, product_name
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        """

result = sql.read_sql(query, con=db_connection)
result

          customer_name                           product_name
0          Eugene Moren            Enermax Note Cards, Premium
1     Dorothy Dickinson     Dania Corner Shelving, Traditional
2        Arthur Prichep  Binney & Smith Sketch Pad, Easy-Erase
3        Grant Thornton             Boston Markers, Easy-Erase
4        Grant Thornton            Eldon Folders, Single Width
...                 ...                                    ...
8042    Susan Vittorini        Fellowes Shelving, Single Width
8043      Dennis Pardue        Wilson Jones Index Tab, Economy
8044           Jim Kriz          Avery Binder Covers, Recycled
8045           Jim Kriz      BIC Pencil Sharpener, Fluorescent
8046           Jim Kriz                    StarTech Phone, Red

[8047 rows x 2 columns]

#### 9.A Select Number of 'Furniture' Orders For Each Country

In [115]:
orders_break_down.head(2)

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture

In [116]:
orders.head(2)

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom

In [119]:
# Select Number of 'Furniture' Orders For Each Country
query = """
        SELECT *
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        WHERE category = 'Furniture';
        """

result = sql.read_sql(query, con=db_connection)
result

,order_id,order_date,customer_name,country,order_id,product_name,discount,sales,quantity,category
0,ES-2011-4869686,2011-01-03,Dorothy Dickinson,United Kingdom,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.00,854,7,Furniture
1,ES-2011-5433855,2011-01-07,Dave Poirier,France,ES-2011-5433855,"Bush Floating Shelf Set, Pine",0.10,155,1,Furniture
2,IT-2011-4546695,2011-01-08,Darren Powers,France,IT-2011-4546695,"Ikea Classic Bookcase, Metal",0.60,987,6,Furniture
3,ES-2011-5158390,2011-01-11,Roy Collins,United Kingdom,ES-2011-5158390,"SAFCO Executive Leather Armchair, Red",0.00,1384,3,Furniture
4,ES-2011-4359424,2011-01-11,Dorothy Dickinson,Spain,ES-2011-4359424,"Bevis Training Table, with Bottom Storage",0.60,268,2,Furniture
...,...,...,...,...,...,...,...,...,...,...
1233,ES-2014-4107155,2014-12-29,Carlos Daly,France,ES-2014-4107155,"Lesro Round Table, Rectangular",0.35,1461,5,Furniture
1234,ES-2014-5861616,2014-12-29,Paul Gonzalez,France,ES-2014-5861616,"Deflect-O Clock, Durable",0.00,189,4,Furniture
1235,ES-2014-3776783,2014-12-30,Tony Chapman,Germany,ES-2014-3776783,"Rubbermaid Door Stop, Ergonomic",0.00,85,2,Furniture
1236,ES-2014-4134163,2014-12-30,Max Ludwig,United Kingdom,ES-2014-4134163,"Office Star Chairmat, Adjustable",0.00,68,1,Furniture
1237,ES-2014-3458802,2014-12-31,John Grady,United Kingdom,ES-2014-3458802,"Ikea Stackable Bookrack, Traditional",0.00,245,2,Furniture

#### 9.B Select Number of 'Furniture' Orders For The Country Denmark

In [127]:
# Select Number of 'Furniture' Orders For The Country Denmark
query = """
        SELECT *, orders_break_down.category
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        WHERE category = 'Furniture' AND country = 'Denmark';
        """

result = sql.read_sql(query, con=db_connection)
result

,order_id,order_date,customer_name,country,order_id,product_name,discount,sales,quantity,category,category
0,ES-2011-1586186,2011-06-16,Vivek Grady,Denmark,ES-2011-1586186,"Office Star Bag Chairs, Set of Two",0.5,87,3,Furniture,Furniture
1,IT-2012-4084224,2012-02-15,Mick Brown,Denmark,IT-2012-4084224,"Rubbermaid Door Stop, Ergonomic",0.6,17,1,Furniture,Furniture
2,IT-2013-4649004,2013-05-31,Bart Folk,Denmark,IT-2013-4649004,"Novimex Executive Leather Armchair, Red",0.5,920,4,Furniture,Furniture
3,ES-2013-3422294,2013-09-07,Dave Brooks,Denmark,ES-2013-3422294,"Advantus Door Stop, Duo Pack",0.6,36,2,Furniture,Furniture
4,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,ES-2014-3653593,"Deflect-O Clock, Black",0.6,161,8,Furniture,Furniture
5,ES-2014-3653593,2014-02-10,Ivan Liston,Denmark,ES-2014-3653593,"Harbour Creations Bag Chairs, Set of Two",0.5,32,1,Furniture,Furniture
6,ES-2014-1415600,2014-07-07,Damala Kotsonis,Denmark,ES-2014-1415600,"Deflect-O Door Stop, Duo Pack",0.6,70,4,Furniture,Furniture
7,IT-2014-1978058,2014-11-13,Anthony Jacobs,Denmark,IT-2014-1978058,"Harbour Creations Steel Folding Chair, Red",0.5,98,2,Furniture,Furniture
8,ES-2014-5784412,2014-11-25,Pete Kriz,Denmark,ES-2014-5784412,"Eldon Light Bulb, Black",0.6,50,5,Furniture,Furniture

#### 10. Select Total Sales With Discount and Without Discount for Each Country

In [129]:
orders_break_down.head(2)

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture

In [128]:
orders.head(2)

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom

In [136]:
# Select Total Sales With Discount and Without Discount for Each Country
query = """
        SELECT country,SUM(orders_break_down.sales) as total_sales, orders_break_down.discount
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        GROUP BY country, discount;
        """

result = sql.read_sql(query, con=db_connection)
result

           country  total_sales  discount
0          Austria        79382      0.00
1          Belgium        42320      0.00
2          Denmark         7429      0.50
3          Denmark          334      0.60
4          Finland        20702      0.00
5           France       129791      0.00
6           France       242038      0.10
7           France       191864      0.15
8           France        29092      0.35
9           France         4375      0.50
10          France         7065      0.60
11          France         5458      0.65
12         Germany       245424      0.00
13         Germany       194834      0.10
14         Germany        19485      0.20
15         Germany        17902      0.35
16         Germany         2547      0.45
17         Germany         7140      0.50
18         Germany          794      0.60
19         Germany          555      0.85
20         Ireland        15781      0.50
21         Ireland          217      0.60
22           Italy       174097      0.00
23           Italy        63419      0.40
24           Italy         8897      0.50
25           Italy         6329      0.60
26     Netherlands         4348      0.20
27     Netherlands        64625      0.50
28     Netherlands         1340      0.70
29          Norway        20529      0.00
30        Portugal        15106      0.50
31           Spain       164895      0.00
32           Spain        67122      0.10
33           Spain        13009      0.20
34           Spain         4376      0.60
35          Sweden        27438      0.50
36          Sweden          734      0.60
37          Sweden         2318      0.70
38     Switzerland        24874      0.00
39  United Kingdom       330854      0.00
40  United Kingdom        68663      0.10
41  United Kingdom         4952      0.30
42  United Kingdom          567      0.40
43  United Kingdom        15322      0.50
44  United Kingdom          139      0.80

#### 11.A Select Total Quantity, Total Sales for Each Country

In [138]:
# Select Total Quantity, Total Sales for Each Country
query = """
        SELECT country,SUM(orders_break_down.sales) as total_sales, SUM(orders_break_down.quantity) as total_quantity
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        GROUP BY country;
        """

result = sql.read_sql(query, con=db_connection)
result

           country  total_sales  total_quantity
0          Austria        79382             973
1          Belgium        42320             532
2          Denmark         7763             204
3          Finland        20702             201
4           France       609683            7329
5          Germany       488681            6179
6          Ireland        15998             392
7            Italy       252742            3612
8      Netherlands        70313            1526
9           Norway        20529             261
10        Portugal        15106             286
11           Spain       249402            2881
12          Sweden        30490             753
13     Switzerland        24874             308
14  United Kingdom       420497            4917

#### 11.B Select Top 3 Country Based on Sales

In [145]:
# Select Top 3 Country Based on Sales
query = """
        SELECT country,SUM(orders_break_down.sales) as total_sales
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        GROUP BY country
        ORDER BY total_sales DESC
        LIMIT 3;
        """

result = sql.read_sql(query, con=db_connection)
result

          country  total_sales
0          France       609683
1         Germany       488681
2  United Kingdom       420497

#### 11.C Select Bottom 3 Country Based On Quantities

In [146]:
orders_break_down.head(2)

,order_id,product_name,discount,sales,quantity,category
0,IT-2011-3647632,"Enermax Note Cards, Premium",0.5,45,3,Office Supplies
1,ES-2011-4869686,"Dania Corner Shelving, Traditional",0.0,854,7,Furniture

In [147]:
orders.head(2)

          order_id  order_date      customer_name         country
0  IT-2011-3647632  2011-01-01       Eugene Moren          Sweden
1  ES-2011-4869686  2011-01-03  Dorothy Dickinson  United Kingdom

In [149]:
# Select Bottom 3 Country Based On Quantities
query = """
        SELECT country,SUM(orders_break_down.quantity) as total_quantity
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        GROUP BY country
        ORDER BY total_quantity ASC
        LIMIT 3;
        """

result = sql.read_sql(query, con=db_connection)
result

   country  total_quantity
0  Finland             201
1  Denmark             204
2   Norway             261

#### 12. Select Average Sales By Categroy For The Country 'France'

In [164]:
# Select Average Sales By Categroy For The Country 'France'
query = """
        SELECT country,orders_break_down.category, AVG(orders_break_down.sales) as avg_sales
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        WHERE country = 'France'
        ORDER BY category;
        """

result = sql.read_sql(query, con=db_connection)
result

  country         category   avg_sales
0  France  Office Supplies  318.206159

In [166]:
query = """
        SELECT
            country,
            orders_break_down.category,
            AVG(orders_break_down.sales) as avg_sales
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        WHERE country = 'France'
        ORDER BY category;
        """

result = sql.read_sql(query, con=db_connection)
result

  country         category   avg_sales
0  France  Office Supplies  318.206159

In [169]:
# orders as o, orders_break_dow as obd
query = """
        SELECT
            o.country,
            obd.category,
            AVG(obd.sales) as avg_sales
        FROM orders o
        LEFT JOIN orders_break_down obd
        ON o.order_id = obd.order_id
        WHERE country = 'France'
        GROUP BY country, category
        ORDER BY avg_sales DESC;
        """

result = sql.read_sql(query, con=db_connection)
result

  country         category   avg_sales
0  France       Technology  595.145078
1  France        Furniture  582.314381
2  France  Office Supplies  167.217709

#### 13. Select Country, Category and Total Sales Where Average Total Sales is The Highest

In [163]:
# Select Country, Category and Total Sales Where Average Total Sales is The Highest
query = """
        SELECT country,orders_break_down.category,AVG(orders_break_down.sales) as avg_sales
        FROM orders
        LEFT JOIN orders_break_down
        ON orders.order_id = orders_break_down.order_id
        GROUP BY country, category
        ORDER BY avg_sales DESC
        LIMIT 1;
        """

result = sql.read_sql(query, con=db_connection)
result

       country    category   avg_sales
0  Switzerland  Technology  902.846154

### JOINS

Below is a link to a handy reference for SQL joins. In this chart joins are represented in terms of sets and venn diagrams. 
https://www.codeproject.com/Articles/33052/Visual-Representation-of-SQL-Joins

Alternatively, remember the merge functionality of pandas.
https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf

### ADDITIONAL RESOURCES

- [sqlite3 home](http://www.sqlite.org)  
- [sqlite3 Python documentation](https://docs.python.org/3/library/sqlite3.html)
- [SQLite Python tutorial](http://sebastianraschka.com/Articles/2014_sqlite_in_python_tutorial.html)  
- [SQL zoo](http://www.sqlzoo.net)  Great for learning syntax



---



---



> > > > > > > > > © 2022 Institute of Data


---



---